# <center> **Adventure Works Project** </center>

This is a project aimed at practicing my skills in exploratory data analytics using SQL. I will be analysing the data from a ficctional business database, named Adventure Works, which was provided by Azure's sample SQL database. I will use an arrange of queries to answer the porposed questions and draw appropriate conclusions.

In [12]:
pip install pyodbc sqlalchemy ipython-sql

Requirement already satisfied: pyodbc in c:\users\inesc\appdata\local\programs\python\python311\lib\site-packages (5.2.0)
Requirement already satisfied: sqlalchemy in c:\users\inesc\appdata\local\programs\python\python311\lib\site-packages (2.0.36)
Requirement already satisfied: ipython-sql in c:\users\inesc\appdata\local\programs\python\python311\lib\site-packages (0.5.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\inesc\appdata\local\programs\python\python311\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\inesc\appdata\local\programs\python\python311\lib\site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: prettytable in c:\users\inesc\appdata\local\programs\python\python311\lib\site-packages (from ipython-sql) (3.11.0)
Requirement already satisfied: ipython in c:\users\inesc\appdata\roaming\python\python311\site-packages (from ipython-sql) (8.28.0)
Requirement already satisfied: sqlparse in c:\users\inesc\appdata\local\programs\python\python311\lib\site-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: six in c:\users\inesc\appdata\local\programs\python\python311\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\inesc\appdata\local\programs\python\python311\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: decorator in c:\users\inesc\appdata\roaming\python\python311\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\inesc\appdata\roaming\python\python311\site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in c:\users\inesc\appdata\roaming\python\python311\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\inesc\appdata\roaming\python\python311\site-packages (from ipython->ipython-sql) (3.0.48)
Requirement already satisfied: pygments>=2.4.0 in c:\users\inesc\appdata\local\programs\python\python311\lib\site-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: stack-data in c:\users\inesc\appdata\roaming\python\python311\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\inesc\appdata\roaming\python\python311\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: colorama in c:\users\inesc\appdata\local\programs\python\python311\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\inesc\appdata\roaming\python\python311\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\users\inesc\appdata\roaming\python\python311\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\users\inesc\appdata\roaming\python\python311\site-packages (from stack-data->ipython->ipython-sql) (2.1.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\inesc\appdata\roaming\python\python311\site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in c:\users\inesc\appdata\roaming\python\python311\site-packages (from stack-data->ipython->ipython-sql) (0.2.3)
Note: you may need to restart the kernel to use updated packages.

In [1]:
%load_ext sql

In [2]:
%sql mssql+pyodbc://ICG216:Upgradepassword1@upgradeservericg.database.windows.net/adventureworks_sql?driver=ODBC+Driver+17+for+SQL+Server

In [6]:
%%sql
SELECT TABLE_NAME 
FROM INFORMATION_SCHEMA.TABLES;

 * mssql+pyodbc://ICG216:***@upgradeservericg.database.windows.net/adventureworks_sql?driver=ODBC+Driver+17+for+SQL+Server
Done.

[('database_firewall_rules',),
 ('Customer',),
 ('ProductModel',),
 ('vProductModelCatalogDescription',),
 ('ProductDescription',),
 ('Product',),
 ('ProductModelProductDescription',),
 ('vProductAndDescription',),
 ('ProductCategory',),
 ('vGetAllCategories',),
 ('BuildVersion',),
 ('ErrorLog',),
 ('Address',),
 ('CustomerAddress',),
 ('SalesOrderDetail',),
 ('SalesOrderHeader',)]

## Exploratory Data Analytics (EDA):

**1. What are the top 10 best-selling products by total revenue?**

In [7]:
%%sql
SELECT TOP 10 
    p.ProductID, 
    p.Name AS ProductName, 
    SUM(od.UnitPrice * od.OrderQty) AS TotalRevenue
FROM 
    SalesLT.SalesOrderDetail od
JOIN 
    SalesLT.Product p ON od.ProductID = p.ProductID
GROUP BY 
    p.ProductID, p.Name
ORDER BY 
    TotalRevenue DESC;

 * mssql+pyodbc://ICG216:***@upgradeservericg.database.windows.net/adventureworks_sql?driver=ODBC+Driver+17+for+SQL+Server
Done.

[(976, 'Road-350-W Yellow, 48', Decimal('38612.4730')),
 (969, 'Touring-1000 Blue, 60', Decimal('37191.4920')),
 (783, 'Mountain-200 Black, 42', Decimal('37178.8380')),
 (782, 'Mountain-200 Black, 38', Decimal('35801.8440')),
 (957, 'Touring-1000 Yellow, 60', Decimal('23745.3372')),
 (967, 'Touring-1000 Blue, 50', Decimal('22887.0720')),
 (780, 'Mountain-200 Silver, 42', Decimal('20879.9100')),
 (973, 'Road-350-W Yellow, 40', Decimal('20411.8800')),
 (784, 'Mountain-200 Black, 46', Decimal('19277.9160')),
 (974, 'Road-350-W Yellow, 42', Decimal('18949.0286'))]

**2. Which products do customers buy most frequently?**

In [23]:
%%sql
SELECT TOP 10
    p.ProductID, 
    p.Name AS ProductName, 
    COUNT(od.SalesOrderDetailID) AS PurchaseCount
FROM 
    SalesLT.SalesOrderDetail od
JOIN 
    SalesLT.Product p ON od.ProductID = p.ProductID
GROUP BY 
    p.ProductID, p.Name
ORDER BY 
    PurchaseCount DESC;

 * mssql+pyodbc://ICG216:***@upgradeservericg.database.windows.net/adventureworks_sql?driver=ODBC+Driver+17+for+SQL+Server
Done.

[(864, 'Classic Vest, S', 10),
 (715, 'Long-Sleeve Logo Jersey, L', 10),
 (712, 'AWC Logo Cap', 9),
 (884, 'Short-Sleeve Classic Jersey, XL', 9),
 (876, 'Hitch Rack - 4-Bike', 8),
 (883, 'Short-Sleeve Classic Jersey, L', 8),
 (877, 'Bike Wash - Dissolver', 7),
 (948, 'Front Brakes', 7),
 (880, 'Hydration Pack - 70 oz.', 7),
 (938, 'LL Road Pedal', 7)]

**3. What is the average order value (AOV) across all customers?**

In [9]:
%%sql
SELECT 
    AVG(od.UnitPrice * od.OrderQty) AS AverageOrderValue
FROM 
    SalesLT.SalesOrderDetail od;

 * mssql+pyodbc://ICG216:***@upgradeservericg.database.windows.net/adventureworks_sql?driver=ODBC+Driver+17+for+SQL+Server
Done.

[(Decimal('1317.3485'),)]

**4. Which products have the highest profit margins?**

In [14]:
%%sql
SELECT TOP 10
    p.ProductID, 
    p.Name AS ProductName, 
    (p.ListPrice - p.StandardCost) AS ProfitMargin
FROM 
    SalesLT.Product p
ORDER BY 
    ProfitMargin DESC;

 * mssql+pyodbc://ICG216:***@upgradeservericg.database.windows.net/adventureworks_sql?driver=ODBC+Driver+17+for+SQL+Server
Done.

[(771, 'Mountain-100 Silver, 38', Decimal('1487.8356')),
 (772, 'Mountain-100 Silver, 42', Decimal('1487.8356')),
 (773, 'Mountain-100 Silver, 44', Decimal('1487.8356')),
 (774, 'Mountain-100 Silver, 48', Decimal('1487.8356')),
 (775, 'Mountain-100 Black, 38', Decimal('1476.8956')),
 (776, 'Mountain-100 Black, 42', Decimal('1476.8956')),
 (777, 'Mountain-100 Black, 44', Decimal('1476.8956')),
 (778, 'Mountain-100 Black, 48', Decimal('1476.8956')),
 (749, 'Road-150 Red, 62', Decimal('1406.9758')),
 (750, 'Road-150 Red, 44', Decimal('1406.9758'))]

**5. Which geographic regions have the highest sales?**

In [15]:
%%sql
SELECT 
    a.City, 
    SUM(od.UnitPrice * od.OrderQty) AS TotalSales
FROM 
    SalesLT.SalesOrderHeader o
JOIN 
    SalesLT.SalesOrderDetail od ON o.SalesOrderID = od.SalesOrderID
JOIN 
    SalesLT.Address a ON o.ShipToAddressID = a.AddressID
GROUP BY 
    a.City
ORDER BY 
    TotalSales DESC;

 * mssql+pyodbc://ICG216:***@upgradeservericg.database.windows.net/adventureworks_sql?driver=ODBC+Driver+17+for+SQL+Server
Done.

[('London', Decimal('154303.6008')),
 ('Woolston', Decimal('90341.5338')),
 ('Union City', Decimal('68142.6132')),
 ('Liverpool', Decimal('65218.8776')),
 ('Fullerton', Decimal('60526.9980')),
 ('Gloucestershire', Decimal('53248.6920')),
 ('Sherman Oaks', Decimal('47848.0260')),
 ('Cerritos', Decimal('34208.9340')),
 ('Van Nuys', Decimal('33319.9860')),
 ('Milton Keynes', Decimal('30900.1746')),
 ('West Sussex', Decimal('30600.9960')),
 ('Santa Fe', Decimal('11528.8440')),
 ('Englewood', Decimal('10585.0500')),
 ('Las Vegas', Decimal('5535.2246')),
 ('Oxnard', Decimal('3774.3240')),
 ('Santa Ana', Decimal('2778.2902')),
 ('Daly City', Decimal('2527.1280')),
 ('Cambridge', Decimal('1929.5940')),
 ('El Segundo', Decimal('1901.4060')),
 ('Camarillo', Decimal('1732.8900')),
 ('Oxon', Decimal('858.9000')),
 ('Auburn', Decimal('713.7960')),
 ('High Wycombe', Decimal('524.6640')),
 ('Sandy', Decimal('500.3040')),
 ('Culver City', Decimal('221.2560')),
 ('Alhambra', Decimal('97.5688')),
 ('Wokingham', Decimal('63.9000')),
 ('Abingdon', Decimal('37.7580')),
 ('Maidenhead', Decimal('31.5840'))]

**6. What is the distribution of order quantities across different product categories?**

In [16]:
%%sql
SELECT 
    pc.Name AS CategoryName, 
    SUM(od.OrderQty) AS TotalQuantity
FROM 
    SalesLT.SalesOrderDetail od
JOIN 
    SalesLT.Product p ON od.ProductID = p.ProductID
JOIN 
    SalesLT.ProductCategory pc ON p.ProductCategoryID = pc.ProductCategoryID
GROUP BY 
    pc.Name
ORDER BY 
    TotalQuantity DESC;

 * mssql+pyodbc://ICG216:***@upgradeservericg.database.windows.net/adventureworks_sql?driver=ODBC+Driver+17+for+SQL+Server
Done.

[('Touring Bikes', 252),
 ('Jerseys', 230),
 ('Road Bikes', 222),
 ('Mountain Bikes', 209),
 ('Mountain Frames', 128),
 ('Helmets', 124),
 ('Vests', 121),
 ('Pedals', 84),
 ('Shorts', 80),
 ('Socks', 66),
 ('Road Frames', 60),
 ('Gloves', 57),
 ('Cleaners', 55),
 ('Bottles and Cages', 54),
 ('Caps', 52),
 ('Hydration Packs', 50),
 ('Saddles', 39),
 ('Touring Frames', 39),
 ('Bike Racks', 32),
 ('Handlebars', 27),
 ('Cranksets', 22),
 ('Bottom Brackets', 22),
 ('Derailleurs', 21),
 ('Tires and Tubes', 20),
 ('Brakes', 13),
 ('Chains', 8)]

**7. What are the top 5 most frequent order days of the week?**

In [17]:
%%sql
SELECT 
    DATENAME(WEEKDAY, o.OrderDate) AS OrderDay, 
    COUNT(o.SalesOrderID) AS OrderCount
FROM 
    SalesLT.SalesOrderHeader o
GROUP BY 
    DATENAME(WEEKDAY, o.OrderDate)
ORDER BY 
    OrderCount DESC;

 * mssql+pyodbc://ICG216:***@upgradeservericg.database.windows.net/adventureworks_sql?driver=ODBC+Driver+17+for+SQL+Server
Done.

[('Sunday', 32)]

**8. Which customers have the highest average order value (AOV)?**

In [21]:
%%sql
SELECT 
    c.CustomerID, 
    c.FirstName, 
    c.LastName, 
    AVG(od.UnitPrice * od.OrderQty) AS AverageOrderValue
FROM 
    SalesLT.Customer c
JOIN 
    SalesLT.SalesOrderHeader o ON c.CustomerID = o.CustomerID
JOIN 
    SalesLT.SalesOrderDetail od ON o.SalesOrderID = od.SalesOrderID
GROUP BY 
    c.CustomerID, c.FirstName, c.LastName
ORDER BY 
    AverageOrderValue DESC;

 * mssql+pyodbc://ICG216:***@upgradeservericg.database.windows.net/adventureworks_sql?driver=ODBC+Driver+17+for+SQL+Server
Done.

[(29660, 'Anthony', 'Chor', Decimal('2392.4013')),
 (29736, 'Terry', 'Eminhizer', Decimal('2100.9659')),
 (29932, 'Rebecca', 'Laszlo', Decimal('1901.7390')),
 (29546, 'Christopher', 'Beck', Decimal('1765.7197')),
 (30050, 'Krishna', 'Sunkammurali', Decimal('1742.2472')),
 (29957, 'Kevin', 'Liu', Decimal('1584.7119')),
 (29796, 'Jon', 'Grande', Decimal('1417.8016')),
 (29877, 'Joyce', 'Jarvis', Decimal('1323.1312')),
 (29929, 'Jeffrey', 'Kurtz', Decimal('1210.5399')),
 (29938, 'Frank', 'Campbell', Decimal('1103.5140')),
 (30113, 'Raja', 'Venugopal', Decimal('1055.2067')),
 (29922, 'Pamala', 'Kotc', Decimal('972.9076')),
 (29531, 'Cory', 'Booth', Decimal('922.5374')),
 (29644, 'Brigid', 'Cavendish', Decimal('858.9000')),
 (29485, 'Catherine', 'Abel', Decimal('774.8833')),
 (29653, 'Pei', 'Chow', Decimal('678.1672')),
 (30019, 'Matthew', 'Miller', Decimal('570.9820')),
 (30102, 'Roger', 'Van Houten', Decimal('482.3985')),
 (29982, 'Melissa', 'Marple', Decimal('421.1880')),
 (30027, 'Joseph', 'Mitzner', Decimal('406.7725')),
 (29975, 'Walter', 'Mays', Decimal('396.8986')),
 (29847, 'David', 'Hodgson', Decimal('356.8980')),
 (29638, 'Rosmarie', 'Carroll', Decimal('346.5780')),
 (30089, 'Michael John', 'Troyer', Decimal('308.9720')),
 (30033, 'Vassar', 'Stern', Decimal('250.1520')),
 (29568, 'Donald', 'Blanton', Decimal('237.6757')),
 (29612, 'Richard', 'Byham', Decimal('174.8880')),
 (29584, 'Walter', 'Brian', Decimal('73.7520')),
 (30072, 'Andrea', 'Thomsen', Decimal('63.9000')),
 (30025, 'Linda', 'Mitchell', Decimal('37.7580')),
 (29781, 'Guy', 'Gilbert', Decimal('32.5229')),
 (29741, 'Janeth', 'Esteves', Decimal('31.5840'))]